# GetCatalogItem

## Description
Show the plug-in item catalog dialog to choose an item defined in the catalog. The object will be updated with all parameters defiend in the catalog.

```pascal
FUNCTION GetCatalogItem(hObj : HANDLE) : BOOLEAN;
```

```python

def vs.GetCatalogItem(hObj):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE|Handle to plug-in object.|

## Returns
TRUE if a catalog item is selected.

## Version
Availability: from Vectorworks 2018
## Category
* Objects - Custom